src_ext/InformationRegisters/УЗ_ДокументыФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ДокументыФизЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВидаДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияНомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_ДокументыФизЛиц/Ext/ManagerModule.bsl
//ИНН и документ, удостоверяющий личность, физического лица (этап 2.1, В41) — для справки об оплате обучения
//(КНД 1151158: налогоплательщик и обучаемый — ИНН или документ) и договора (паспорт заказчика). Отдельно от
//карточки физ. лица: у педагога на карточку есть «Чтение» (уроки, ученики), а на этот регистр прав нет вовсе.
//Храним ровно то, что просит бланк справки: ИНН, код вида документа, серию и номер, дату выдачи.

#Область ПрограммныйИнтерфейс

//Структура(ИНН, КодВидаДокумента, СерияНомерДокумента, ДатаВыдачиДокумента, ВидДокумента) — пустые, если записи нет.
Функция ДанныеФизЛица(ФизЛицо) Экспорт

	Данные = НовыеДанныеФизЛица();
	Если Не ЗначениеЗаполнено(ФизЛицо) Тогда
		Возврат Данные;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыФизЛиц.ИНН КАК ИНН,
	|	ДокументыФизЛиц.КодВидаДокумента КАК КодВидаДокумента,
	|	ДокументыФизЛиц.СерияНомерДокумента КАК СерияНомерДокумента,
	|	ДокументыФизЛиц.ДатаВыдачиДокумента КАК ДатаВыдачиДокумента
	|ИЗ
	|	РегистрСведений.УЗ_ДокументыФизЛиц КАК ДокументыФизЛиц
	|ГДЕ
	|	ДокументыФизЛиц.ФизЛицо = &ФизЛицо";
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Данные, Выборка);
		Данные.ВидДокумента = ВидДокумента(Данные.КодВидаДокумента);
	КонецЕсли;
	Возврат Данные;

КонецФункции

//Пустая структура данных физ. лица (поля — как ресурсы регистра, плюс ВидДокумента словами).
Функция НовыеДанныеФизЛица() Экспорт

	Возврат Новый Структура("ИНН, КодВидаДокумента, СерияНомерДокумента, ДатаВыдачиДокумента, ВидДокумента",
		"", "", "", Дата(1, 1, 1), "");

КонецФункции

//Записать данные физ. лица (Данные — структура с полями ДанныеФизЛица); всё пусто — запись удаляется.
Процедура ЗаписатьДанныеФизЛица(ФизЛицо, Данные) Экспорт

	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.ФизЛицо.Установить(ФизЛицо);
	Если ЗначениеЗаполнено(Данные.ИНН) Или ЗначениеЗаполнено(Данные.КодВидаДокумента)
		Или ЗначениеЗаполнено(Данные.СерияНомерДокумента) Или ЗначениеЗаполнено(Данные.ДатаВыдачиДокумента) Тогда
		Запись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Данные);
		Запись.ФизЛицо = ФизЛицо;
	КонецЕсли;
	Набор.Записать();

КонецПроцедуры

//Есть ли чем удостоверить лицо в справке: ИНН или документ (код вида и серия с номером).
Функция ЕстьИННИлиДокумент(Данные) Экспорт

	Возврат Не ПустаяСтрока(Данные.ИНН)
		Или (Не ПустаяСтрока(Данные.КодВидаДокумента) И Не ПустаяСтрока(Данные.СерияНомерДокумента));

КонецФункции

//Ошибки данных (массив строк): ИНН физ. лица — 12 цифр с верными контрольными разрядами; код вида документа — из
//перечня приложения к порядку заполнения справки; документ — код и серия с номером вместе.
Функция ОшибкиДанных(Данные) Экспорт

	Ошибки = Новый Массив;
	ТекстОшибкиИНН = ОшибкаИНН(Данные.ИНН, 12);
	Если Не ПустаяСтрока(ТекстОшибкиИНН) Тогда
		Ошибки.Добавить(ТекстОшибкиИНН);
	КонецЕсли;
	Если Не ПустаяСтрока(Данные.КодВидаДокумента)
		И ВидыДокументов().НайтиПоЗначению(Данные.КодВидаДокумента) = Неопределено Тогда
		Ошибки.Добавить(СтрШаблон(НСтр("ru = 'Код вида документа «%1» не из перечня ФНС (21 — паспорт гражданина "
			+ "РФ, 03 — свидетельство о рождении…).'"),
			Данные.КодВидаДокумента));
	КонецЕсли;
	Если ПустаяСтрока(Данные.КодВидаДокумента) <> ПустаяСтрока(Данные.СерияНомерДокумента) Тогда
		Ошибки.Добавить(НСтр("ru = 'Документ, удостоверяющий личность: укажите и вид, и серию с номером.'"));
	КонецЕсли;
	Возврат Ошибки;

КонецФункции

//Текст ошибки ИНН или "" (пустой ИНН — не ошибка: указывается при наличии). Длина — 12 (физ. лицо, ИП) или 10
//(организация). Контрольные разряды — по алгоритму ФНС.
Функция ОшибкаИНН(Знач ИНН, Длина = 12) Экспорт

	ИНН = СокрЛП(ИНН);
	Если ПустаяСтрока(ИНН) Тогда
		Возврат "";
	КонецЕсли;
	Если СтрДлина(ИНН) <> Длина Или Не ТолькоЦифры(ИНН) Тогда
		Возврат СтрШаблон(НСтр("ru = 'ИНН «%1»: нужно %2 цифр.'"), ИНН, Длина);
	КонецЕсли;
	Если Длина = 12 Тогда
		Верно = КонтрольныйРазряд(ИНН, "7,2,4,10,3,5,9,4,6,8") = Число(Сред(ИНН, 11, 1))
			И КонтрольныйРазряд(ИНН, "3,7,2,4,10,3,5,9,4,6,8") = Число(Сред(ИНН, 12, 1));
	Иначе
		Верно = КонтрольныйРазряд(ИНН, "2,4,10,3,5,9,4,6,8") = Число(Сред(ИНН, 10, 1));
	КонецЕсли;
	Если Не Верно Тогда
		Возврат СтрШаблон(НСтр("ru = 'ИНН «%1»: неверные контрольные цифры — проверьте, нет ли опечатки.'"), ИНН);
	КонецЕсли;
	Возврат "";

КонецФункции

//Коды видов документа — приложение к порядку заполнения справки (приказ ФНС от 18.10.2023 № ЕД-7-11/755@).
//СписокЗначений: значение — код, представление — «21 — Паспорт гражданина Российской Федерации».
Функция ВидыДокументов() Экспорт

	Виды = Новый СписокЗначений;
	Перечень =
	"21|Паспорт гражданина Российской Федерации
	|03|Свидетельство о рождении
	|07|Военный билет
	|08|Временное удостоверение, выданное взамен военного билета
	|10|Паспорт иностранного гражданина
	|11|Свидетельство о рассмотрении ходатайства о признании лица беженцем на территории РФ по существу
	|12|Вид на жительство в Российской Федерации
	|13|Удостоверение беженца
	|14|Временное удостоверение личности гражданина Российской Федерации
	|15|Разрешение на временное проживание в Российской Федерации
	|19|Свидетельство о предоставлении временного убежища на территории Российской Федерации
	|23|Свидетельство о рождении, выданное уполномоченным органом иностранного государства
	|24|Удостоверение личности военнослужащего Российской Федерации
	|27|Военный билет офицера запаса
	|91|Иные документы";
	Для Каждого СтрокаПеречня Из СтрРазделить(Перечень, Символы.ПС) Цикл
		Части = СтрРазделить(СтрокаПеречня, "|");
		Виды.Добавить(Части[0], Части[0] + " — " + Части[1]);
	КонецЦикла;
	Возврат Виды;

КонецФункции

//Наименование вида документа по коду ("" — код пуст или не из перечня).
Функция ВидДокумента(Код) Экспорт

	Элемент = ВидыДокументов().НайтиПоЗначению(Код);
	Возврат ?(Элемент = Неопределено, "", Сред(Элемент.Представление, СтрДлина(Код) + 4));

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТолькоЦифры(Текст)

	Для Позиция = 1 По СтрДлина(Текст) Цикл
		Если СтрНайти("0123456789", Сред(Текст, Позиция, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;

КонецФункции

Функция КонтрольныйРазряд(ИНН, Веса)

	Сумма = 0;
	Позиция = 0;
	Для Каждого Вес Из СтрРазделить(Веса, ",") Цикл
		Позиция = Позиция + 1;
		Сумма = Сумма + Число(Вес) * Число(Сред(ИНН, Позиция, 1));
	КонецЦикла;
	Возврат Сумма % 11 % 10;

КонецФункции

#КонецОбласти
